code-maven-plugin/trunk/esb/esb-management/esb-management-audit/src/test/resources/com/deppon/esb/management/audit/META-INF/dao/data/esbLogMessage_json.txt

[{"header":{"requestId":"nimborum in","esbServiceCode":"ESB_COMMON2ESB_FOSS_QUERY_WAYBILL_DETAIL","password":null,"version":"1.0","responseId":"111222555","username":null,"messageFormat":"SOAP","sourceSystem":"COMMON","targetSystem":"FOSS","backServiceCode":"FOSS_ESB2FOSS_FOSS_QUERY_WAYBILL_DETAIL","resultCode":1,"businessId":"111222555","exchangePattern":1},"body":"<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Header><esbHeader xmlns=\"http://www.deppon.com/esb/header\" xmlns:ns2=\"http://www.deppon.com/esb/inteface/domain/waybillService\" xmlns:ns3=\"http://www.deppon.com/esb/exception\"><version>1.0</version><businessId>111222555</businessId><requestId>nimborum in</requestId><responseId>111222555</responseId><sourceSystem>COMMON</sourceSystem><targetSystem>FOSS</targetSystem><esbServiceCode>ESB_COMMON2ESB_FOSS_QUERY_WAYBILL_DETAIL</esbServiceCode><backServiceCode>FOSS_ESB2FOSS_FOSS_QUERY_WAYBILL_DETAIL</backServiceCode><messageFormat>SOAP</messageFormat><exchangePattern>1</exchangePattern><resultCode>1</resultCode></esbHeader></soap:Header><soap:Body><ns2:QueryDetailResponse xmlns=\"http://www.deppon.com/esb/header\" xmlns:ns2=\"http://www.deppon.com/esb/inteface/domain/waybillService\" xmlns:ns3=\"http://www.deppon.com/esb/exception\"/></soap:Body></soap:Envelope>"},{"header":{"username":null,"messageFormat":"SOAP","sourceSystem":"COMMON","requestId":"nimborum in","esbServiceCode":"ESB_COMMON2ESB_FOSS_QUERY_WAYBILL_DETAIL","exchangePattern":1,"businessId":"111222555","password":null,"version":"1.0"},"body":"<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:head=\"http://www.deppon.com/esb/header\" xmlns:way=\"http://www.deppon.com/esb/inteface/domain/waybillService\">\n   <soapenv:Header>\n      <head:esbHeader>\n         <head:version>1.0</head:version>\n         <head:businessId>111222555</head:businessId>\n         <head:requestId>nimborum in</head:requestId>\n         <head:sourceSystem>COMMON</head:sourceSystem>\n         <head:esbServiceCode>ESB_COMMON2ESB_FOSS_QUERY_WAYBILL_DETAIL</head:esbServiceCode>\n         <head:messageFormat>SOAP</head:messageFormat>\n         <head:exchangePattern>1</head:exchangePattern>\n      </head:esbHeader>\n   </soapenv:Header>\n   <soapenv:Body>\n      <way:QueryDetailRequest>\n         <way:waybillNo>111222555</way:waybillNo>\n      </way:QueryDetailRequest>\n   </soapenv:Body>\n</soapenv:Envelope>"}]